app/controllers/dojos_controller.rb

  def index
      @dojos = Dojo.all
---
SELECT "dojos".* FROM "dojos"

  def edit
      @dojo = Dojo.find(params[:id])
---
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 3]]

  def show
    #   render json: params
    @dojo = Dojo.find(params[:id])
---
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 1]]

  def destroy
    #   render json: params
    Dojo.find(params[:id]).destroy
---
DELETE FROM "dojos" WHERE "dojos"."id" = ?  [["id", 1]]
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 1]]

  def create
    #   render json: params --> take this data to create it
    Dojo.create(dojo_params) #pass in the funtion
---
INSERT INTO "dojos" ("branch", "city", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["branch", "kbvji"], ["city", "ig"], ["state", "iuyg"], ["created_at", "2017-04-15 22:40:29.458687"], ["updated_at", "2017-04-15 22:40:29.458687"]]

  def update
      Dojo.find(params[:id]).update(dojo_params)
---
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "dojos" SET "city" = ?, "updated_at" = ? WHERE "dojos"."id" = ?  [["city", "Sillicon Valley"], ["updated_at", "2017-04-16 00:08:00.490555"], ["id", 3]]