app/controllers/students_controller.rb

  def edit
      @student = Student.find(params[:id])
      @other_dojos = Dojo.where.not(id: @student.dojo.id)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 3]]

  def new
    #   render text: "made it to the new method"
    @dojo = Dojo.find(params[:dojo_id])
---
SELECT  "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", 0]]

  def create
    #   render json: params
    Student.create(student_params)
---
INSERT INTO "students" ("first_name", "last_name", "email", "dojo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Amer"], ["last_name", "Gheith"], ["email", "amer@gmailc.om"], ["dojo_id", 3], ["created_at", "2017-04-16 06:41:44.193028"], ["updated_at", "2017-04-16 06:41:44.193028"]]

  def update
    #   render json: params
    Student.find(params[:id]).update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Hamza"], ["updated_at", "2017-04-16 19:58:23.668237"], ["id", 1]]

  def destroy
      Student.find(params[:id]).destroy
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 4]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 4]]